spec/fixtures/vcr_cassettes/ogone/visa_payment_acceptance.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/orderdirect.asp
    body:
      encoding: UTF-8
      string: ALIAS=LAHGD2NV&COM=%23zydj53sa&ECI=9&EMAIL=email2%40user.com&Operation=SAL&OwnerZip=1004&Owneraddress=Avenue+de+France+71&PSPID=jilion&PSWD=WWQMNC89&SHASign=C865A5D389B2146B3F1C340BEE879228227F5718165B76825D8633FD71B5E37BB5DA5AC8AFEDA17FC4551569B79C8E0550AC1AFDA7D2142AB9EE0FABBB9ACBC9&USERID=sublime&amount=9999&currency=USD&orderID=c7ad21ledxlwbhwot7wxxjcb5jyrca&ownercty=CH&ownertown=Lausanne
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 01 Oct 2013 13:31:37 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '283'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Tue, 01 Oct 2013 13:30:36 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_1682247214_0=1886251257_2147207;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\n\t\t\t\r\norderID=\"c7ad21ledxlwbhwot7wxxjcb5jyrca\"\r\nPAYID=\"0\"\r\nNCSTATUS=\"5\"\r\nNCERROR=\"50001111\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"0\"\r\nECI=\"9\"\r\namount=\"\"\r\ncurrency=\"USD\"\r\nPM=\"\"\r\nBRAND=\"\"\r\nALIAS=\"LAHGD2NV\"\r\nNCERRORPLUS=\"
        Alias LAHGD2NV not Found\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Tue, 01 Oct 2013 13:31:37 GMT
recorded_with: VCR 2.6.0
